src/Enums/Базар_ВидыСопроводительныхДокументов/Базар_ВидыСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыСопроводительныхДокументов</name>
  <enumValues>
    <name>ДекларацияСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СертификатСоответствия</name>
  </enumValues>
  <enumValues>
    <name>КачественноеУдостоверение</name>
  </enumValues>
  <enumValues>
    <name>ПротоколЛабораторногоИсследования</name>
  </enumValues>
  <enumValues>
    <name>ИнформационноеПисьмо</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/СопроводительныйДокументФормыКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СопроводительныйДокументФормыКлиент: клиентские процедуры и функции, вызываемые 
// из форм документа "Сопроводительный документ".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Объект = Форма.Объект;
	
	Объект.КемВыдан = СокрЛП(Объект.КемВыдан);
	Объект.КомуВыдан = СокрЛП(Объект.КомуВыдан);
	
	// Формируем номер, так чтобы он был уникален вне зависимости
	// от периодичности (которая определена поставщиком, к примеру
	// - качественные удостоверения нумеруются, как правило, в пределах года)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ДекларацияСоответствия") Тогда
		Префикс = "Декл";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.СертификатСоответствия") Тогда
		Префикс = "Серт";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.КачественноеУдостоверение") Тогда
		Префикс = "Кач";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ПротоколЛабораторногоИсследования") Тогда
		Префикс = "ЛабИсл";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ИнформационноеПисьмо") Тогда
		Префикс = "Инф";
	КонецЕсли;

	НаименованиеКомуВыдано = "";
	СтрокаГод = "";

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ИнформационноеПисьмо") Тогда
		МассивУдаляемыхСимволов = Новый Массив;
		МассивУдаляемыхСимволов.Добавить(" ");
		МассивУдаляемыхСимволов.Добавить("""");
		МассивУдаляемыхСимволов.Добавить(".");
		МассивУдаляемыхСимволов.Добавить("/");
		МассивУдаляемыхСимволов.Добавить("\");
		МассивУдаляемыхСимволов.Добавить("-");
		МассивУдаляемыхСимволов.Добавить(";");
		МассивУдаляемыхСимволов.Добавить(":");
		МассивУдаляемыхСимволов.Добавить("!");
		МассивУдаляемыхСимволов.Добавить("*");
		МассивУдаляемыхСимволов.Добавить("+");
		МассивУдаляемыхСимволов.Добавить("=");
		МассивУдаляемыхСимволов.Добавить("|");
		МассивУдаляемыхСимволов.Добавить("&");
		МассивУдаляемыхСимволов.Добавить("^");
		МассивУдаляемыхСимволов.Добавить("@");
		МассивУдаляемыхСимволов.Добавить("%");
		МассивУдаляемыхСимволов.Добавить(",");
		МассивУдаляемыхСимволов.Добавить("(");
		МассивУдаляемыхСимволов.Добавить(")");
		МассивУдаляемыхСимволов.Добавить("'");
		МассивУдаляемыхСимволов.Добавить("`");
		МассивУдаляемыхСимволов.Добавить("$");
		
		НаименованиеКомуВыдано = Объект.КомуВыдан;
		Для Каждого УдаляемыйСимвол ИЗ МассивУдаляемыхСимволов Цикл
			НаименованиеКомуВыдано = СтрЗаменить(НаименованиеКомуВыдано, УдаляемыйСимвол, "");
		КонецЦикла;
		НаименованиеКомуВыдано = НаименованиеКомуВыдано + "-";
		
		СтрокаГод = Формат(Объект.Дата, "ДФ=yyyy") + "-";

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.КачественноеУдостоверение") Тогда
		СтрокаГод = Формат(Объект.Дата, "ДФ=yyyy") + "-";
	КонецЕсли;

	Форма.Объект.НомерДокумента = ВРЕГ(СОКРЛП(Объект.НомерДокумента));
	Форма.Объект.Номер = Префикс + "-" + СтрокаГод + НаименованиеКомуВыдано + Форма.Объект.НомерДокумента;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		КлючеваяОперация = "ПроведениеСопроводительныйДокумент";
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	КонецЕсли;
	
	// Передаем в ПараметрыЗаписи адреса во временном хранилище данных
	// (в принадлежность к номеру строки в таблице Изображения)
	АдресаВременногоХранилища = Новый Массив;
	
	Для Каждого ДанныеИзображения из Объект.Изображения цикл
		ФайлИзображения = Новый Картинка(ДанныеИзображения.ПолныйПуть);
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлИзображения, Форма.УникальныйИдентификатор);		
		АдресаВременногоХранилища.Добавить(АдресВременногоХранилища);
	КонецЦикла;
	
	ПараметрыЗаписи.Вставить("АдресаВременногоХранилища", АдресаВременногоХранилища);

КонецПроцедуры
